{
    "NL": {
        "Description": "Dit was mijn eerste serieuze game, waar we met ze drieën aan hebben gewerkt. Dit was ook de eerste keer werken in Unity met C#.<br>Ik heb hier een goede basic geleerd van game development, want heb een paar mechanics gemaakt.<br>Ook heb ik een beetje game design gedaan en het uit werken ervan.<br><a href=\"AAR.html\" style=\"color: aqua;\">We gaan dit nog een keer opnieuw maken,</a> maar dan met meer kennis.",
        "Warning": "(De beelden die je hieronder ziet kunnen afwijken van het eind product. Er waren veel problemen met de github, er is niet echt een final version.)",
        "Play": "Klik hier om naar de playable game te gaan!<br>",
        "Player Stats": "In een game met actie is het leuk als je een health systeem heb, die heb ik dus ook gemaakt.<br>Via een UI element kan ik laten zien wat je health points zijn.<br>Daarna maakte ik wat pixel art voor de health bar.<br>Toen was ik benieuwd of ik de kleur van de health points kon veranderen als het bijna op is, dus als het 15% is ongeveer dat wordt het rood en op 40% wordt het geel.<br>Ook kan het over tijd langzaam terug komen.<br>Daarna deedt ik Ctrl+C en Ctrl+V, toen was er een Mana en Stamina bar.",
        "Egg": "Coins zijn zo saai en te veel in games, wat als het eieren zijn. Heb een coins systeem gemaakt, maar dan met eieren.<br>Dit is het enigste wat ik heb gemoddeld en getextured heb.<br><br>Elke keer wanneer je een ei op pak zie je dat je hoeveelheid eieren omhoog is gegaan, dit is gedaan in de OnCollisonEnter() funcite gedaan.<br>Ook krijg je een beetje Health, Mana en Stamina, maar het is een beetje random met de hoeveelheid.",
        "Door key": "Er zijn magische muren waar je niet langs kan komen, behalve als je een groot aan heb gepakt.<br>Het is vergelijkbaar met een deur en sleutel, want als je het ei heb op gepakt dan kan je door de muur heen.",
        "Menu's": "Als laats heb ik vooral menu’s gemaakt.<br>Zoals de main menu om het spel te starten, om naar de settings te gaan en om naar de credtis te gaan.<br>Heb ook gewerkt aan de pause menu, hierdoor wordt het spel op pauze gezet en je kan hier terug naar de main menu en het spel afsluiten."
    },

    "EN": {
        "Description": "This was my first serious game, which the three of us worked on. This was also the first time working in Unity with C#.<br>I learned a good basic of game development here, because I made a few mechanics.<br>I also did a bit of game design and working it out.<br><a href=\"AAR.html\" style=\"color: aqua;\">We're going to recreate this one more time,</a> but with more knowledge.",
        "Warning": "(The images you see below may differ from the final product. There were many problems with the github, there is not really a final version.)",
        "Play": "Click here to go to the playable game!<br>",
        "Player Stats": "In a game with action it is nice if you have a health system, so I made that too.<br>I can show what your health points are via a UI element.<br>Then I made some pixel art for the health bar.<br>Then I was wondering if I could change the color of the health points when it's running low, so if it's about 15% it turns red.<br>Then I did Ctrl+C and Ctrl+V, then there was a Mana and Stamina bar.<br>It can also come back slowly over time.",
        "Egg": "Coins are so boring and too much in games, what if it's eggs. Made a coins system, but with eggs.<br>This is all I've modeled and textured.<br>Every time you can eat an egg you will see that your amount of eggs has increased.<br>Also you get a bit of Health, Mana and Stamina, but it's a bit random.",
        "Door key": "There are magical walls that you can't get past unless you've grabbed a big one.<br>It's similar to a door and key, because if you pick up the egg you can go through the wall.",
        "Menu's": "Finally, I mainly made menus.<br>Like the main menu to start the game, to go to the settings and to go to the credits.<br>Also worked on the pause menu, this puts the game on pause and you can go back to the main menu here and close the game."
    }
}