{
    "EN": {
        "Introductie": "Mijn naam is Bas de Reus en ik ben 19 jaar oud.<br>Ik ben een game developer die woont in Zaandam, Nederland.<br>Op het moment ben ik een 4de jaars bij het Mediacollege Amsterdam.",
        "Why": "Ik wil graag games maken, want ik wil het plezier die kreeg van games kunnen geven aan andere.<br>Dit is de rede waarom ik een gameplay programmer ben. Ik werk graag aan gameplay feature’s.<br>Ik heb het meeste ervaring met Unity en C#, dit is te vinden op <a href=\"All-Projects\" class=\"link\">deze pagina</a>.<br>Wat ik ook graag doe is de leiding nemen in het project, dit heb ik vaak gedaan met de rol scrummaster.",
        "Gaming": "Natuurlijk als game developer speel ik ook games.<br>Alleen op het moment wat minder dan vroeger want ik vind het maken veel leuker.<br>Ik ben van jongs af aan het gamen, toen speelde ik het meeste op mijn DS en Wii.<br>Hedens daag speel ik het meest op mijn PC en switch.<br>Ik vind de genres building en simulatie het leuks, als ik al mijn speeltijd moet geloven.<br>Maar een competitieve game vind ik ook leuk.",
        "Contact": "Hier is mijn CV <a href=\"CV - NL.pdf\" class=\"link\" target=\"_blank\">NL</a> - <a href=\"CV - ENG.pdf\" class=\"link\" target=\"_blank\">ENG</a>. Wil je mijn <a href=\"https://github.com/bas-boop\" class=\"link\">github</a> zien?<br>Je kan mij bereiken via mijn email: <span style=\"text-shadow: 0 0 8px rgb(255, 253, 135), 0 0 12px rgb(251, 255, 0);\">dereusbas461@gmail.com</span>!<br>Als je het wil kan je mij ook contacteren op <a href=\"https://www.linkedin.com/in/bas-de-reus-7b0536244/\" class=\"link\">Linkedin</a>!<br>Wil je mij bereiken via discord, dan is dit mijn tag <span style=\"text-shadow: 0 0 8px rgb(255, 253, 135), 0 0 12px rgb(251, 255, 0);\">baz_geluk9#9978</span>!<br>Wil jij games spelen: <a href=\"https://baz-geluk9.itch.io\" class=\"link\" target=\"_blank\">itch.io</a><br>Heb ook een <a href=\"https://www.artstation.com/baz_geluk9\" class=\"link\">Artsation</a>, hier staat veel pixel art op."
    },

    "NL": {
        "Introductie": "My name is Bas de Reus and I am 19 years old.<br>I am a game developer living in Zaandam, the Netherlands.<br>At the moment I am a 4th year student at the Mediacollege Amsterdam.",
        "Why": "I like to make games, because I want to be able to give the enjoyment that games got to others.<br>This is why I am a gameplay programmer. I like to work on gameplay features.<br>I have the most experience with Unity and C#, which can be found on <a href=\"All-Projects\" class=\"link\">this page</a>.<br>What I also like to do is take the lead in the project, I have often done this with the role of scrum master.",
        "Gaming": "Of course as a game developer I also play games.<br>Only at the moment a little less than before because I find making it much more fun.<br>I've been gaming since I was a kid, when I mostly played on my DS and Wii.<br>These days I mostly play on my PC and Switch.<br>I like the building and simulation genres, if I'm to believe all my playing time.<br>But I also like a competitive game.",
        "Contact": "Here is my CV <a href=\"CV - NL.pdf\" class=\"link\" target=\"_blank\">NL</a> - <a href=\"CV - ENG.pdf\" class=\"link\" target=\"_blank\">ENG</a>. Would you like to check out my <a href=\"https://github.com/bas-boop\" class=\"link\">github</a>?<br>You can reach me using this email: <span style=\"text-shadow: 0 0 8px rgb(255, 253, 135), 0 0 12px rgb(251, 255, 0);\">dereusbas461@gmail.com</span>!<br>If you want you can also contact me at <a href=\"https://www.linkedin.com/in/bas-de-reus-7b0536244/\" class=\"link\">Linkedin</a>!<br>If you'd like to reach my via discord, here's my tag <span style=\"text-shadow: 0 0 8px rgb(255, 253, 135), 0 0 12px rgb(251, 255, 0);\">baz_geluk9#9978</span>!<br>You want to play games: <a href=\"https://baz-geluk9.itch.io\" class=\"link\" target=\"_blank\">itch.io</a><br>Also have a <a href=\"https://www.artstation.com/baz_geluk9\" class=\"link\">Artsation</a>, it has a lot of pixel art on it."
    }
}