{
    "EN": {
        "Description": "Een VR karaoke game in opdracht voor <a href=\"https://www.avrotros.nl\" class=\"link\" target=\"_blank\">AVROTROS</a>, dit is tijdens mijn stage gemaakt bij <a href=\"https://www.xr-lab.nl\" class=\"link\" target=\"_blank\">XR-Lab</a>!<br>Tijdens dit project heb ik de rollen van game developer en scrum master opgepakt.<br><br>De bedoeling is een om de TV show “Beste Zangers” te vertalen naar een VR mulitplayer game.<br>Een groot leer moment met dit project was,<br>maak feature’s met mulitplayer vanaf het begin EN neem een week tijd om alles te bespreken met het team.",
        "SES": "Tijdens karaoké wil je niet saai een beetje zingen,<br>daarom hebben we special effects zoals confetti, rookmachine, vuurwerk en lampen die draaien.<br>De bedoel was dat de andere spelers dit zou doen via de knoppen, maar mulitplayer werd hem niet.<br>Hierdoor is de random events ontstaan.",
        "Character": "In een mulitplayer game wil je natuurlijk dat iemand jou representeert.<br>Daarom heb ik gewerkt aan character selection.<br>Ook nog dat de VR rig is gekoppeld aan de models van de charachter, alleen dit is jammer genoeg niet gebruikt wan mulitplayer is er niet.",
        "Win": "Voor elke game is er een gameloop nodig. Klein probleem, het is de laatste sprint en er is geen gameloop.<br>Dus ik en Daniel hebben hele (niet) mooie code geschreven om een game loop te maken in weinig tijd.<br>Wat er in moet zitten is een moment dat de AI en speler hebben gezongen, zodat er een winner kan gekozen worden.<br>Er was gepland om een vote system te maken, maar weinig tijd dus dan maar random 1 van de 2 kiezen.<br>Onderaan staat code voor de winscreen om te laten draaien."
    },
    
    "NL": {
        "Description": "A VR karaoke game commissioned for <a href=\"https://www.avrotros.nl\" class=\"link\" target=\"_blank\">AVROTROS</a>, this was made during my internship at <a href=\"https://www.xr-lab.nl\" class=\"link\" target=\"_blank\">XR-Lab</a>!<br>During this project I took on the roles of game developer and scrum master.<br><br>The intention is to translate the TV show “Beste Zangers” into a VR mulitplayer game.<br>A big learning moment with this project was,<br>create features with mulitplayer in mind AND take a week to discuss everything for the game with the team.",
        "SES": "During karaoke you don't want to sing a bit that's boring,<br>that's why we have special effects such as confetti, smoke machine, fireworks and lamps that rotate.<br>The intention was that the other players would do this via the buttons, but mulitplayer didn't get in.<br>This resulted are the random events.",
        "Character": "In a multiplayer game you naturally want someone to represent you.<br>That's why I worked on character selection.<br>Also that the VR rig is linked to the models of the charachter, but unfortunately this is not used because mulitplayer didn't get in the game.",
        "Win": "A game loop is required for every game. Small problem, it's the last sprint and there is no gameloop.<br>So me and Daniel wrote some (not so) great code to make a game loop in little time.<br>What should be in it is a moment that the AI and player have sung, so that a winner can be chosen.<br>It was planned to make a vote system, but little time so just randomly choose 1 of the 2.<br>At the bottom is code for the winscreen to trun."
    }
}