{
    "EN": {
        "Description": "Dit is een groot project waarin ik een developer ben. Het is een onderdeel van het HLO (hybride leer omgeving).<br>Dit houdt in dat voornamelijk studeten er aan werken, naast 2 docenten/product owners.<br>Elke 10 weken wordt er een nieuwe selectie aan studenten gekozen, je kan meerdere keren gekozen worden.<br>De game is een 2.5D Metroidvania Couch Co-op gebaseerd op de cartoons van 80's Sci-Fi. Het is een game dat gaat om momentum.<br>Wat interessant is om te vertellen, is dat deze game zijn eigen force systeem heeft.<br>Dat vergelijkbaar is met Rigidbody wat in Unity zit, maar dan beter naar mijn mening.",
        "Andere OS": "Heb aan hetzelfde project ook gewerkt aan <span><a href=\"OperationStarfall-CPS.html\" style=\"color:aqua;\">Custom Physics System</a></span> en <span><a href=\"OperationStarfall-PS.html\" style=\"color:aqua;\">Pickup System</a></span>.",
        "Git": "<span style=\"color: red;\">De git repository is op privé!</span><br>Het wordt een commerciële game.",
        "JumpMomentum": "Wanneer je tijdens het lopen zou springen en dan lopen los laat dan zal je naar benden vallen, alsof je een onzichtbare muur zal raken.<br>Beetje onlogische, ik heb er voor gezorgd dat je momentum zal blijven houden.<br>Dit heb ik gedaan met een force te geven wanneer je geen input meer geef.",
        "JumpMomentum2": "Bij de eerste versie verloor je wat controlle, want je krijgt een set distance mee geven, die je wel kan om draaien.<br>Alleen je kon geen tap geven en een beetje verder komen.<br><br>Daarom verander ik de air accleration dynamis met wel of niet input geven in de lucht.<br>Hierdoor kan je ook uit stilstaan graduweel bewegen in de lucht.",
        "Dropping": "Optimaliseren van het loslaten van de ledge wanneer je er aan hangt.<br>Je kon er namelijk alleen boven op komen, dus we hebben het gemaakt dat je het gewoon kan loslaten, waardoor je naar beneden valt.<br>Dit geeft meer opties en logica aan het spel.",
        "Falling": "Als je van een hoogte zal komen naar de grond, dan zou je momentum houden wanneer je land op de grond.<br>Hierdoor sta je niet ineens stil op de grond wanneer je heel snel ging.<br>Dit hebben we gedaan via de forces van de Force System.",
        "Deceleration": "Heb ook gewerkt aan de Deceleration van de speler.<br>Dus als je aan het lopen bent en stopt met input geven, dan doe je nog een paar kleine stappen totdat je echt stil staat.<br>Hierdoor sta je niet gelijk stil alsof je een muur raakt.",
        "Scrum": "Wat ik ook heb gedaan is voor 1 sprint scrum master zijn, voor 2 weken.<br>Dus de daylie stand-ups en -downs organiseren en door de dag heen bij iedereen checken of het lukt met wat ze maken.<br>Ook kijk ik of iedereen wel de todo’s op Trello goed hebben staan.",
        "Conclusion": "Wat ik vooral geleerd heb is in een groot team werken en een betere programmeur worden.<br>Want we verdiepen in game development wat ik niet zou bereiken met een simpel 8 weken school project."
    },

    "NL": {
        "Description": "This is a major project which I worked on as a developer. It is the main product of a HLO (Hybrid Learning Environment) that I was a part of.<br>This means that the project was spearheaded by two teachers/product owners, and worked on by primarily students.<br>The pool of students fluctuates every 10 weeks, however you may choose to stay for another 10.<br>The product we're working on is a 2.5D couch co-op metroidvania with an aesthetic reminiscent of 80's era cartoons.<br>The main basis of the game going into it was ''Momentum''. This is reinforced in the engine we work in, Unity. Where we've made a whole physics system from the ground up.<br>That is similar to Rigidbody which is in Unity, but better in my opinion.",
        "Andere OS": "I also worked on the same project on <span><a href=\"OperationStarfall-CPS.html\" style=\"color:aqua;\">Custom Physics System</a></span> and <span><a href=\"OperationStarfall-PS.html\" style=\"color:aqua;\">Pickup System</a></span>.",
        "Git": "<span style=\"color: red;\">The git repository is on private!</span><br>It will be a commercial game.",
        "JumpMomentum": "If you were to jump while walking and then let go of walking, you would fall down, as if you were going to hit an invisible wall.<br>I made it so when you don't give input anymore that you get some force.",
        "JumpMomentum2": "With the first version you lost some control, because you get a set distance, which you can reverse.<br>Only you couldn't tap and get a little further.<br><br>That's why I change the air acceleration dynamically with whether or not to give input in the air.<br>This allows you to gradually move in the air from standing still.",
        "Dropping": "Optimizing the release of the ledge when hanging from it.<br>You could only get on top of it, so we made it so that you can just let it go, causing you to fall down.<br>This gives more options and logic to the game.",
        "Falling": "If you are going to come down from a height to the ground, you would maintain momentum when you land on the ground.<br>This means you don't suddenly stand still on the ground when you go very fast.<br>We did this through the forces of the Force System.",
        "Deceleration": "Also worked on the player's Deceleration.<br>So if you are walking and stop giving input, you take a few more small steps until you really come to a standstill.<br>This means you don't immediately stand still as if you hit a wall.",
        "Scrum": "What I have also done is to be a sprint scrum master for 2 weeks.<br>So the daylie organize stand-ups and downs and check with everyone throughout the day if what they are making is working.<br>I also check whether everyone has the todo's on Trello correct.",
        "Conclusion": "What I learned most is to work in a large team and become a better programmer.<br>Because we delve into game development that I wouldn't achieve with a simple 8 week school project."
    }
}