{
    "EN": {
        "Description": "De eerste paar dingen waar ik aan in heb gewerkt in dit project, is het tweaken van de player movement.<br>Waaronder de jump momentum, ledge grabbing en releasing en deceration.<br>Dit heeft mij geleerd hoe om al bestaande code te lezen.",
        "Andere OS": "Heb aan hetzelfde project ook gewerkt aan <span><a href=\"OperationStarfall-CPS.html\" class=\"link\">Custom Physics System</a></span> en <span><a href=\"OperationStarfall-PS.html\" class=\"link\">Pickup System</a></span>.",
        "Git": "<span style=\"color: red;\">De git repository is op privé!</span><br>Het wordt een commerciële game.",
        "JumpMomentum": "Wanneer je tijdens het lopen zou springen en dan lopen los laat dan zal je naar benden vallen, alsof je een onzichtbare muur zal raken.<br>Beetje onlogische, ik heb er voor gezorgd dat je momentum zal blijven houden.<br>Dit heb ik gedaan met een force te geven wanneer je geen input meer geef.",
        "JumpMomentum2": "Bij de eerste versie verloor je wat controlle, want je krijgt een set distance mee geven, die je wel kan om draaien.<br>Alleen je kon geen tap geven en een beetje verder komen.<br><br>Daarom verander ik de air accleration dynamis met wel of niet input geven in de lucht.<br>Hierdoor kan je ook uit stilstaan graduweel bewegen in de lucht.",
        "Dropping": "Optimaliseren van het loslaten van de ledge wanneer je er aan hangt.<br>Je kon er namelijk alleen boven op komen, dus we hebben het gemaakt dat je het gewoon kan loslaten, waardoor je naar beneden valt.<br>Dit geeft meer opties en logica aan het spel.",
        "Falling": "Als je van een hoogte zal komen naar de grond, dan zou je momentum houden wanneer je land op de grond.<br>Hierdoor sta je niet ineens stil op de grond wanneer je heel snel ging.<br>Dit hebben we gedaan via de forces van de Force System.",
        "Deceleration": "Heb ook gewerkt aan de Deceleration van de speler.<br>Dus als je aan het lopen bent en stopt met input geven, dan doe je nog een paar kleine stappen totdat je echt stil staat.<br>Hierdoor sta je niet gelijk stil alsof je een muur raakt."
    },

    "NL": {
        "Description": "The first few things I worked on in this project is tweaking the player movement.<br>Including the jump momentum, ledge grabbing and releasing and deceration.<br>This taught me how to improve existing code read.",
        "Andere OS": "I also worked on the same project on <span><a href=\"OperationStarfall-CPS.html\" class=\"link\">Custom Physics System</a></span> and <span><a href=\"OperationStarfall-PS.html\" class=\"link\">Pickup System</a></span>.",
        "Git": "<span style=\"color: red;\">The git repository is on private!</span><br>It will be a commercial game.",
        "JumpMomentum": "If you were to jump while walking and then let go of walking, you would fall down, as if you were going to hit an invisible wall.<br>I made it so when you don't give input anymore that you get some force.",
        "JumpMomentum2": "With the first version you lost some control, because you get a set distance, which you can reverse.<br>Only you couldn't tap and get a little further.<br><br>That's why I change the air acceleration dynamically with whether or not to give input in the air.<br>This allows you to gradually move in the air from standing still.",
        "Dropping": "Optimizing the release of the ledge when hanging from it.<br>You could only get on top of it, so we made it so that you can just let it go, causing you to fall down.<br>This gives more options and logic to the game.",
        "Falling": "If you are going to come down from a height to the ground, you would maintain momentum when you land on the ground.<br>This means you don't suddenly stand still on the ground when you go very fast.<br>We did this through the forces of the Force System.",
        "Deceleration": "Also worked on the player's Deceleration.<br>So if you are walking and stop giving input, you take a few more small steps until you really come to a standstill.<br>This means you don't immediately stand still as if you hit a wall."
    }
}