{
    "EN": {
        "Description": "Dit is een passie project van mij.<br>Op het moment ben ik veel aan het designen en prototypen.<br><a href=\"https://trello.com/b/hPXQKk13/platypus-game\" class=\"link\" target=\"_blank\">Trello</a>, hier kan je zien wat er nog gedaan gaat worden of wat af is.<br><a href=\"https://github.com/bas-boop/Platypus-game\" class=\"link\" target=\"_blank\">Github</a></span>, hier kan je de source code van alles zien.<br><a href=\"https://www.tatumdevries.dev\" class=\"link\" target=\"_blank\">Tatum</a> heeft veel geholpen met het design.",
        "StateMachine": "Ik had niet genoeg controle over de player vond ik, dus ik heb een StateMachine ervoor gemaakt om meer controle over te hebben.<br>Als ik toch bezig ben waarom niet een abstract StateMachine en gelijk enemy StateMachine maken.<br>Er is ook een state queue gemaakt, dit is vooral handig voor de speler. Was je net te vroeg met je input, dan wordt het alsnog gedaan.<br>Dit heeft een grote focus op S.R.P., anders kon ik de hele speler in 1 class maken.<br>Wat ik hiervan heb geleerd een betere begrip over abstract classes en diepe duik in code nemen vind ik heel leuk.",
        "Pick-up": "Dit is een pick-up system met een PickType als Enum. Ook heb je een inleverpunt om de opgepakt items in te leveren.<br>Dit heeft een goede implantatie van SRP.<br>Ook is er een custom inspector gemaakt om de inventory Dictionary te zien.",
        "Dash": "De feature waardoor het project is gestart.<br>Dit lijkt heel erg op een debug feature die ik had gemaakt tijdens <a href=\"OperationStarfall-CPS.html\" class=\"link\">Custom Physics System</a>, het leek me leuk om het terug te brengen.<br><br>Wanneer je klikt op het scherm daar dashed de speler naartoe.<br><a href=\"https://gist.github.com/bas-boop/663866777ceeb2516123d659d004b2cc\" target=\"_blank\" class=\"link\">Het gehele script.<a/>"
    },

    "NL": {
        "Description": "This is a passion project of mine.<br>I'm doing a lot of designing and prototyping right now.<br><a href=\"https://trello.com/b/hPXQKk13/platypus-game\" class =\"link\" target=\"_blank\">Trello</a>, here you can see what is still to be done or what is finished.<br><a href=\"https://github.com/bas-boop/Platypus-game\" class=\"link\" target=\"_blank\">Github</a>, here you can see the source code of everything.<br><a href=\"https://www.tatumdevries.dev\" class=\"link\" target=\"_blank\">Tatum</a> helped a lot with the design.",
        "StateMachine": "I didn't have enough control over the player, so I made a StateMachine for it to have more control over it.<br>While I'm at it why not make an abstract StateMachine and enemy StateMachine right away.<br>A state queue has also been created, this is especially useful for the player. If you were just too early with your input, it will still be done.<br>This has a big focus on S.R.P., otherwise I could make the whole player in 1 class.<br>What I learned from this a better understanding about abstract classes and deep diving into code I do enjoy.",
        "Pick-up": "This is a pick-up system with a PickType as Enum. You also have a delivery point to hand in the picked up items.<br>This has good implantation of SRP.<br>A custom inspector has also been created to view the inventory Dictionary.",
        "Dash": "The feature that started the project.<br>This is very similar to a debug feature I made during <a href=\"OperationStarfall-CPS.html\" class=\"link\">Custom Physics System</a>, I thought it would be nice to bring it back.<br><br>When you click on the screen the player dashes to that.<br><a href=\"https://gist.github.com/bas-boop/663866777ceeb2516123d659d004b2cc\" target=\"_blank\" class=\"link\">The entire script.<a/>"
    }
}